[
  {
    "english": "crust",
    "chinese": "地壳",
    "example": "The Earth's crust is made up of several large and small tectonic plates."
  },
  {
    "english": "slam",
    "chinese": "猛烈抨击",
    "example": "The newspaper slammed the government's environmental policies in an editorial."
  },
  {
    "english": "content",
    "chinese": "内容",
    "example": "The website's content focuses on sustainable living and eco-friendly practices."
  },
  {
    "english": "destruction",
    "chinese": "破坏",
    "example": "Deforestation leads to the destruction of natural habitats for wildlife."
  },
  {
    "english": "mine",
    "chinese": "矿",
    "example": "The old mine was reopened to extract valuable minerals from the earth."
  },
  {
    "english": "raw",
    "chinese": "未经加工的",
    "example": "Factories process raw materials into finished products for consumers."
  },
  {
    "english": "layer",
    "chinese": "层次",
    "example": "Geologists study the different layers of rock to understand Earth's history."
  },
  {
    "english": "vast",
    "chinese": "巨大的",
    "example": "The vast desert stretches for hundreds of miles with few signs of life."
  },
  {
    "english": "mat",
    "chinese": "垫子",
    "example": "She placed a protective mat under the potted plant to avoid damaging the floor."
  },
  {
    "english": "unlike",
    "chinese": "不像",
    "example": "Unlike most mammals, platypuses lay eggs instead of giving birth to live young."
  },
  {
    "english": "hammer",
    "chinese": "锤子",
    "example": "The carpenter used a hammer to nail the pieces of wood together."
  },
  {
    "english": "pluck",
    "chinese": "弹拨",
    "example": "He began to pluck the guitar strings, creating a soft and melodic tune."
  },
  {
    "english": "gradual",
    "chinese": "逐渐的",
    "example": "The gradual change in climate is affecting the migration patterns of many bird species."
  },
  {
    "english": "polar",
    "chinese": "极地的",
    "example": "Polar bears are well-adapted to survive in the harsh conditions of the Arctic."
  }
]