[
  {
    "english": "Baltimore",
    "chinese": "巴尔的摩（美国马里兰州北部海港，1990年人口736，000）",
    "example": "Baltimore is known for its historic harbor and vibrant cultural scene."
  },
  {
    "english": "neighborhood",
    "chinese": "街区",
    "example": "The neighborhood hosted a summer festival to bring residents together."
  },
  {
    "english": "combination",
    "chinese": "结合",
    "example": "The recipe uses a combination of herbs and spices to enhance flavor."
  },
  {
    "english": "pretend",
    "chinese": "假装",
    "example": "Children often pretend to be superheroes while playing in the park."
  },
  {
    "english": "replacement",
    "chinese": "更换",
    "example": "The company offered a free replacement for the defective product."
  },
  {
    "english": "senior",
    "chinese": "上级",
    "example": "She consulted with her senior before making the important decision."
  },
  {
    "english": "accurately",
    "chinese": "准确地",
    "example": "The weather forecast accurately predicted the storm two days in advance."
  },
  {
    "english": "aspect",
    "chinese": "方面",
    "example": "They discussed every aspect of the project before starting the work."
  },
  {
    "english": "context",
    "chinese": "上下文",
    "example": "Understanding the context is crucial for interpreting the meaning of the text."
  },
  {
    "english": "data",
    "chinese": "数据",
    "example": "The research team analyzed the data to find patterns and trends."
  },
  {
    "english": "mayor",
    "chinese": "市长",
    "example": "The mayor addressed the community during the town hall meeting."
  },
  {
    "english": "theory",
    "chinese": "理论",
    "example": "Scientists continue to test the theory through various experiments."
  },
  {
    "english": "claim",
    "chinese": "要求",
    "example": "He made a claim for compensation after the accident."
  },
  {
    "english": "convince",
    "chinese": "说服",
    "example": "She tried to convince her friend to join the environmental campaign."
  },
  {
    "english": "disappointment",
    "chinese": "失望",
    "example": "His face showed disappointment when he learned about the canceled trip."
  },
  {
    "english": "ingredient",
    "chinese": "成分",
    "example": "Flour and sugar are basic ingredients in many baking recipes."
  },
  {
    "english": "logically",
    "chinese": "逻辑上",
    "example": "Logically, increasing sales should lead to higher profits for the business."
  },
  {
    "english": "via",
    "chinese": "通过",
    "example": "They communicated with each other via email while working remotely."
  },
  {
    "english": "optic",
    "chinese": "视觉的",
    "example": "The artist created an optic illusion that changed when viewed from different angles."
  }
]