[
  {
    "english": "failure",
    "chinese": "失败",
    "example": "The project's failure was due to insufficient funding and poor planning."
  },
  {
    "english": "merely",
    "chinese": "仅仅",
    "example": "The study shows that stress is merely one factor affecting overall health."
  },
  {
    "english": "overcome",
    "chinese": "克服",
    "example": "Scientists are working to overcome challenges in renewable energy technology."
  },
  {
    "english": "potentially",
    "chinese": "潜在地",
    "example": "Ocean currents have the potential to affect global climate patterns significantly."
  },
  {
    "english": "statistically",
    "chinese": "统计地",
    "example": "Statistically, urban areas have higher air pollution levels than rural regions."
  },
  {
    "english": "inspire",
    "chinese": "启发思考",
    "example": "The documentary aims to inspire viewers to take action on environmental issues."
  },
  {
    "english": "phenomenon",
    "chinese": "现象",
    "example": "The melting of polar ice is a phenomenon directly linked to global warming."
  },
  {
    "english": "publish",
    "chinese": "发表",
    "example": "Researchers publish their findings in scientific journals to share knowledge."
  },
  {
    "english": "reject",
    "chinese": "拒绝",
    "example": "The committee decided to reject the proposal due to its environmental impact."
  },
  {
    "english": "romantic",
    "chinese": "浪漫的",
    "example": "The poet uses romantic imagery to describe the beauty of natural landscapes."
  },
  {
    "english": "subjective",
    "example": "Opinions on art can be subjective, varying from person to person."
  },
  {
    "english": "decade",
    "example": "Over the past decade, there has been a surge in eco-friendly innovations."
  },
  {
    "english": "instructor",
    "example": "The biology instructor explained the complexity of ecosystem interactions."
  },
  {
    "english": "significantly",
    "example": "Reducing plastic use can significantly decrease ocean pollution."
  },
  {
    "english": "adopt",
    "example": "Many countries have adopted stricter policies to protect endangered species."
  },
  {
    "english": "evaluate",
    "example": "Scientists evaluate the health of coral reefs by studying fish populations."
  },
  {
    "english": "vice",
    "example": "Deforestation for profit is seen as a vice for global environmental health."
  },
  {
    "english": "glimpse",
    "example": "Satellite images give scientists a glimpse into remote polar ecosystems."
  },
  {
    "english": "statue",
    "example": "The ancient statue depicts a deity associated with natural phenomena."
  }
]