[
  {
    "english": "graphic",
    "chinese": "图表",
    "example": "The textbook uses a colorful graphic to explain the process of photosynthesis."
  },
  {
    "english": "imaginative",
    "chinese": "富有想象力的",
    "example": "The imaginative children's book tells a story about talking animals in a magical forest."
  },
  {
    "english": "feature",
    "chinese": "特征",
    "example": "A distinctive feature of the species is its ability to survive in extreme temperatures."
  },
  {
    "english": "transform",
    "chinese": "改变，转换",
    "example": "The new policy aims to transform the healthcare system for better accessibility."
  },
  {
    "english": "conventional",
    "chinese": "传统的",
    "example": "Unlike conventional methods, the new approach saves both time and resources."
  },
  {
    "english": "resemble",
    "chinese": "类似于",
    "example": "The ancient artifact resembles a tool used by early civilizations for farming."
  },
  {
    "english": "comical",
    "chinese": "滑稽的",
    "example": "His comical dance moves entertained the crowd at the family gathering."
  },
  {
    "english": "somewhat",
    "chinese": "稍微",
    "example": "The soup was somewhat spicy, so she added a bit of milk to reduce the heat."
  },
  {
    "english": "domesticate",
    "chinese": "驯养",
    "example": "Early humans learned to domesticate animals for transportation and food."
  },
  {
    "english": "arise(arose/arisen)",
    "chinese": "出现",
    "example": "Challenges often arise when implementing new technologies in traditional industries."
  },
  {
    "english": "stock",
    "chinese": "通常有的",
    "example": "The supermarket ensures a stock supply of fresh produce every morning."
  },
  {
    "english": "peasant",
    "chinese": "农民",
    "example": "The story describes the daily life of a peasant during the medieval period."
  },
  {
    "english": "erode",
    "chinese": "腐蚀",
    "example": "Acid rain can erode stone buildings and historical monuments over time."
  },
  {
    "english": "decompose",
    "chinese": "分解",
    "example": "Bacteria help decompose organic matter in the soil, enriching it with nutrients."
  },
  {
    "english": "microorganism",
    "chinese": "微生物",
    "example": "Microorganisms play a crucial role in breaking down waste in the environment."
  },
  {
    "english": "convert",
    "chinese": "转化",
    "example": "Solar panels convert sunlight into electricity for household use."
  },
  {
    "english": "sediment",
    "chinese": "沉淀物",
    "example": "Layers of sediment at the bottom of the lake provide clues about past climates."
  },
  {
    "english": "weathering",
    "chinese": "风化",
    "example": "The process of weathering breaks down rocks into smaller particles over centuries."
  },
  {
    "english": "nutrient",
    "chinese": "营养物",
    "example": "Plants absorb essential nutrients from the soil to support their growth."
  },
  {
    "english": "repeatedly",
    "chinese": "反复地",
    "example": "She practiced the piano piece repeatedly until she mastered every note."
  },
  {
    "english": "excessive",
    "chinese": "过度的",
    "example": "Excessive use of pesticides can harm both the environment and human health."
  },
  {
    "english": "geological",
    "chinese": "地质学的",
    "example": "Geological studies show that the area was once covered by an ancient sea."
  },
  {
    "english": "quantity",
    "chinese": "数量",
    "example": "The recipe requires a specific quantity of flour to ensure the cake's texture."
  },
  {
    "english": "retain",
    "chinese": "保持",
    "example": "Certain plants can retain water in their leaves to survive in dry climates."
  },
  {
    "english": "cloak",
    "chinese": "斗篷",
    "example": "The character in the novel wears a magical cloak that makes him invisible."
  },
  {
    "english": "element",
    "chinese": "元素",
    "example": "Oxygen is a vital element for all living organisms on Earth."
  },
  {
    "english": "reproduce",
    "chinese": "再制造",
    "example": "3D printers can reproduce complex objects with high precision."
  },
  {
    "english": "significant",
    "chinese": "重要的",
    "example": "There has been a significant improvement in air quality since the new policies were implemented."
  },
  {
    "english": "substantial",
    "chinese": "大量的",
    "example": "The company invested a substantial amount of money in renewable energy projects."
  },
  {
    "english": "abundant",
    "chinese": "大量的",
    "example": "The region is known for its abundant natural resources, including oil and gas."
  },
  {
    "english": "adversely",
    "chinese": "不利地",
    "example": "Changes in temperature can adversely affect the growth of certain crops."
  },
  {
    "english": "scarce",
    "chinese": "稀少的",
    "example": "Fresh water is becoming increasingly scarce in many parts of the world."
  },
  {
    "english": "phenomena",
    "chinese": "现象",
    "example": "Scientists study natural phenomena like earthquakes to predict and prepare for them."
  },
  {
    "english": "interrupt",
    "chinese": "中断",
    "example": "The storm caused a power outage that interrupted communication services for hours."
  },
  {
    "english": "evolve",
    "chinese": "进化，发展",
    "example": "Language continues to evolve as new words and phrases are added over time."
  },
  {
    "english": "preserve",
    "chinese": "保护",
    "example": "Efforts are being made to preserve ancient forests from deforestation."
  },
  {
    "english": "property",
    "chinese": "属性",
    "example": "One important property of metal is its ability to conduct electricity."
  },
  {
    "english": "distinct",
    "chinese": "明显的; 清晰的",
    "example": "The bird has a distinct call that helps identify it among other species."
  }
]