[
  {
    "english": "well-documented",
    "chinese": "被广泛记录的",
    "example": "The effects of climate change on polar ecosystems are well-documented in scientific studies."
  },
  {
    "english": "amnesia",
    "chinese": "记忆缺失",
    "example": "The patient's amnesia made it difficult to recall details of the car accident."
  },
  {
    "english": "fur",
    "chinese": "毛皮",
    "example": "Arctic animals like polar bears rely on their thick fur to survive freezing temperatures."
  },
  {
    "english": "bet",
    "chinese": "打赌",
    "example": "I bet you can't name three animals that adapt to extreme climates."
  },
  {
    "english": "extreme climate",
    "chinese": "极端气候",
    "example": "Scientists study how plants survive in regions with extreme climate conditions."
  },
  {
    "english": "hare",
    "chinese": "野兔",
    "example": "The snow hare changes its fur color to blend in with the winter snow."
  },
  {
    "english": "variation",
    "chinese": "变化",
    "example": "There's a noticeable variation in bird migration patterns due to global warming."
  },
  {
    "english": "mechanism",
    "chinese": "机制，结构方式",
    "example": "The body's immune mechanism helps fight off harmful bacteria."
  },
  {
    "english": "foraging",
    "chinese": "觅食",
    "example": "Deer spend hours foraging for food in the forest each day."
  },
  {
    "english": "incident",
    "chinese": "事件",
    "example": "The exhibition includes art inspired by historical environmental incidents."
  },
  {
    "english": "it follows that ...",
    "chinese": "因此...",
    "example": "Animals adapt to their environment; it follows that climate change affects their survival."
  },
  {
    "english": "sculptor",
    "chinese": "雕塑家",
    "example": "The sculptor created a statue of a hare to show nature's resilience."
  },
  {
    "english": "sculpture",
    "chinese": "雕塑",
    "example": "The exhibition features a sculpture of an animal in an extreme climate."
  },
  {
    "english": "portray",
    "chinese": "描绘",
    "example": "The artist portrays environmental themes in their latest work."
  },
  {
    "english": "portrait",
    "chinese": "肖像",
    "example": "The portrait captures the hare's adaptation to its habitat perfectly."
  },
  {
    "english": "prominently",
    "chinese": "突出地",
    "example": "The exhibition prominently displays sculptures of animals in harsh environments."
  },
  {
    "english": "ratio",
    "chinese": "比率; 比例",
    "example": "The ratio of fur thickness to body size is key for arctic animals."
  },
  {
    "english": "thereby",
    "chinese": "从而; 由此; 因此;",
    "example": "The sculpture highlights adaptation, thereby raising awareness about climate issues."
  },
  {
    "english": "diminish",
    "chinese": "减少",
    "example": "Warmer temperatures diminish the snow cover, affecting hare populations."
  },
  {
    "english": "architecture",
    "chinese": "建筑学",
    "example": "The building's architecture incorporates elements of natural adaptation."
  },
  {
    "english": "residential",
    "chinese": "住宅的",
    "example": "Residential areas near forests often face wildlife encounters."
  },
  {
    "english": "theme",
    "chinese": "主题",
    "example": "The exhibition's theme is nature's resilience in extreme climates."
  },
  {
    "english": "exhibition",
    "chinese": "展览",
    "example": "Don't miss the prestigious exhibition on environmental art."
  },
  {
    "english": "prestigious",
    "chinese": "有声望的",
    "example": "She won an award from a prestigious art organization."
  },
  {
    "english": "solo",
    "chinese": "独自的; 单独的",
    "example": "The artist is holding a solo exhibition of their nature-inspired works."
  },
  {
    "english": "assumption",
    "chinese": "假设",
    "example": "The study challenges the assumption that all hares adapt similarly to heat."
  },
  {
    "english": "bacteria",
    "chinese": "细菌",
    "example": "Some bacteria thrive in inorganic environments, defying common beliefs."
  },
  {
    "english": "inorganic",
    "chinese": "无机的",
    "example": "Inorganic materials in the soil affect plant growth in extreme climates."
  },
  {
    "english": "organic",
    "chinese": "有机的",
    "example": "Organic matter in the soil helps plants survive harsh weather."
  },
  {
    "english": "verbalize",
    "chinese": "用言语表达",
    "example": "The artist struggles to verbalize the impact of climate change through sculpture."
  },
  {
    "english": "theory",
    "chinese": "理论",
    "example": "The theory explains how animals develop variations for survival."
  },
  {
    "english": "neighboring",
    "chinese": "临近的",
    "example": "Neighboring ecosystems often share similar adaptation mechanisms."
  },
  {
    "english": "characteristic/feature",
    "chinese": "特征",
    "example": "A key characteristic of arctic hares is their seasonal fur color change."
  }
]