[
  {
    "english": "evolutionary",
    "chinese": "进化相关的",
    "example": "The study of fossils provides insights into evolutionary changes in species over time."
  },
  {
    "english": "gravitational",
    "chinese": "引力的; 重力引起的",
    "example": "The gravitational pull of the Moon affects Earth's tides and ocean currents."
  },
  {
    "english": "genre",
    "chinese": "体裁",
    "example": "Science fiction is a popular genre that explores hypothetical scientific advancements."
  },
  {
    "english": "interact with",
    "chinese": "互动",
    "example": "Children learn social skills by interacting with their peers in playgrounds."
  },
  {
    "english": "critic",
    "chinese": "批评家，评论家",
    "example": "The film was praised by critics for its innovative storytelling and cinematography."
  },
  {
    "english": "structured",
    "chinese": "结构化的",
    "example": "A structured learning plan helps students stay focused and achieve academic goals."
  },
  {
    "english": "radical",
    "chinese": "根本的；激进的",
    "example": "The company implemented radical changes to its management structure to boost efficiency."
  },
  {
    "english": "experimental",
    "chinese": "实验性的",
    "example": "The artist's experimental style combines traditional painting with digital technology."
  },
  {
    "english": "predecessor",
    "chinese": "前身",
    "example": "This new smartphone model has improved features compared to its predecessor."
  },
  {
    "english": "improvise",
    "chinese": "即兴发挥",
    "example": "Musicians often improvise solos during jazz performances to showcase creativity."
  },
  {
    "english": "improvisational",
    "chinese": "即兴发挥的",
    "example": "The theater group is known for its improvisational comedy shows without scripted dialogues."
  },
  {
    "english": "intangible",
    "chinese": "无形的",
    "example": "Trust and creativity are intangible assets that drive team collaboration."
  },
  {
    "english": "attribute",
    "chinese": "特质，特点",
    "example": "Patience is a key attribute for anyone working in customer service roles."
  },
  {
    "english": "affect and inspire",
    "chinese": "影响和激发",
    "example": "Great leaders have the ability to affect and inspire others through their actions."
  },
  {
    "english": "violate",
    "chinese": "违反",
    "example": "Companies that violate environmental regulations face heavy fines and legal consequences."
  },
  {
    "english": "maxim",
    "chinese": "法则",
    "example": "The maxim 'less is more' is often applied in minimalist design aesthetics."
  },
  {
    "english": "applicant",
    "chinese": "申请人",
    "example": "Each applicant must submit a resume and cover letter with their job application."
  },
  {
    "english": "supervision",
    "chinese": "监督",
    "example": "Children should be under adult supervision when using swimming pools."
  },
  {
    "english": "a letter of recommendation",
    "chinese": "推荐信",
    "example": "Graduate school applications typically require a letter of recommendation from professors."
  },
  {
    "english": "principle",
    "chinese": "原则",
    "example": "Honesty is a fundamental principle that guides her decision-making in both work and life."
  },
  {
    "english": "dress neatly",
    "chinese": "打扮很干净",
    "example": "Job seekers are advised to dress neatly for interviews to make a good first impression."
  },
  {
    "english": "contribute to",
    "chinese": "有助于",
    "example": "Regular exercise and a balanced diet contribute to better physical and mental health."
  },
  {
    "english": "quality",
    "chinese": "品格，品质",
    "example": "Compassion is a quality that allows people to connect with others empathetically."
  },
  {
    "english": "qualified",
    "chinese": "够格的，有资格的",
    "example": "Only qualified engineers with relevant experience can apply for this advanced position."
  },
  {
    "english": "subtle",
    "chinese": "微妙的",
    "example": "The painting's subtle color variations create a sense of depth and movement."
  },
  {
    "english": "sarcasm/irony",
    "chinese": "讽刺",
    "example": "His use of sarcasm often makes it difficult for others to understand his true intentions."
  },
  {
    "english": "capacity",
    "chinese": "容量",
    "example": "The new water tank has a capacity to store 10,000 liters for the entire community."
  },
  {
    "english": "perceived",
    "chinese": "察觉到",
    "example": "She perceived a sense of tension in the room during the important business meeting."
  },
  {
    "english": "solution",
    "chinese": "解决方案",
    "example": "Scientists are working on a solution to reduce plastic waste in ocean ecosystems."
  },
  {
    "english": "distraction",
    "chinese": "使人分心的事",
    "example": "Turning off notifications can help eliminate distractions while working on complex tasks."
  },
  {
    "english": "ignore",
    "chinese": "忽视",
    "example": "It's unwise to ignore warning signs of health issues and delay seeking medical advice."
  },
  {
    "english": "convey",
    "chinese": "输送",
    "example": "Poets use words to convey complex emotions that are difficult to express directly."
  },
  {
    "english": "orbit",
    "chinese": "轨道",
    "example": "Earth takes approximately 365 days to complete one orbit around the Sun."
  },
  {
    "english": "former",
    "chinese": "以前的",
    "example": "The former president returned to public life to advocate for environmental causes."
  },
  {
    "english": "humor",
    "chinese": "幽默",
    "example": "His dry humor often makes people laugh even in serious conversations."
  },
  {
    "english": "impression",
    "chinese": "印象",
    "example": "The first impression of a book's cover can influence a reader's decision to purchase it."
  },
  {
    "english": "decline",
    "chinese": "减少",
    "example": "There has been a steady decline in the number of bees, threatening global food security."
  },
  {
    "english": "disruptive",
    "chinese": "破坏性的",
    "example": "The storm caused disruptive power outages across the entire region."
  },
  {
    "english": "overwhelming",
    "chinese": "压倒性的",
    "example": "The team received overwhelming support from fans during the championship game."
  },
  {
    "english": "organism",
    "chinese": "生物",
    "example": "Microscopic organisms in the soil play a vital role in nutrient cycling."
  },
  {
    "english": "coral reef",
    "chinese": "珊瑚礁",
    "example": "Coral reefs provide habitats for thousands of marine species and protect coastlines from erosion."
  },
  {
    "english": "deplete",
    "chinese": "消耗",
    "example": "Overfishing can deplete fish populations and disrupt ocean ecosystems."
  },
  {
    "english": "algae",
    "chinese": "藻类",
    "example": "Algae blooms in lakes can be harmful to aquatic life due to oxygen depletion."
  },
  {
    "english": "organic",
    "chinese": "有机的",
    "example": "Organic farming avoids the use of synthetic pesticides and promotes sustainable agriculture."
  },
  {
    "english": "moisture",
    "chinese": "湿润，水分",
    "example": "Plants absorb moisture from the soil through their roots to support growth."
  },
  {
    "english": "soak",
    "chinese": "浸泡",
    "example": "Soaking beans overnight makes them easier to cook and digest."
  },
  {
    "english": "migration",
    "chinese": "迁移",
    "example": "Bird migration patterns are influenced by seasonal changes in temperature and food availability."
  },
  {
    "english": "choke",
    "chinese": "(使)窒息",
    "example": "Plastic waste in the ocean can choke marine animals that mistake it for food."
  },
  {
    "english": "viable",
    "chinese": "可行的",
    "example": "Solar power is a viable alternative energy source for reducing carbon emissions."
  },
  {
    "english": "advocate",
    "chinese": "支持者",
    "example": "She is a passionate advocate for human rights and social justice issues."
  },
  {
    "english": "cite",
    "chinese": "引用",
    "example": "Academic papers must cite sources to give credit to original researchers."
  },
  {
    "english": "conceivable",
    "chinese": "可以想象的",
    "example": "It's conceivable that renewable energy will replace fossil fuels in the next few decades."
  }
]