[
  {
    "english": "ash tree",
    "chinese": "白蜡树",
    "example": "Ash trees are commonly found in temperate forests and are known for their hard wood."
  },
  {
    "english": "mechanical",
    "chinese": "机动的",
    "example": "Mechanical devices like tractors have revolutionized modern agriculture."
  },
  {
    "english": "originate",
    "chinese": "起源",
    "example": "The custom of celebrating New Year originates from ancient cultural traditions."
  },
  {
    "english": "medium",
    "chinese": "介质",
    "example": "Water is an excellent medium for sound to travel through."
  },
  {
    "english": "interplanetary",
    "chinese": "行星间的",
    "example": "Scientists are developing technologies for interplanetary travel to Mars."
  },
  {
    "english": "dense",
    "chinese": "密集的",
    "example": "The dense forest provides a habitat for a variety of wildlife species."
  },
  {
    "english": "fundamentally",
    "chinese": "根本上",
    "example": "The two theories differ fundamentally in their approach to solving the problem."
  },
  {
    "english": "diverse",
    "chinese": "多种多样的",
    "example": "The region is home to a diverse range of plant and animal species."
  },
  {
    "english": "dominate",
    "chinese": "支配",
    "example": "Large corporations often dominate the global market for electronic devices."
  },
  {
    "english": "marine",
    "chinese": "海的",
    "example": "Marine biologists study the ecosystems and species that live in the ocean."
  },
  {
    "english": "thrive",
    "chinese": "繁荣",
    "example": "Some plants thrive in tropical climates with high temperatures and humidity."
  },
  {
    "english": "tropical",
    "chinese": "热带的",
    "example": "Tropical rainforests are known for their high biodiversity and unique species."
  },
  {
    "english": "temperate",
    "chinese": "温和的",
    "example": "The region has a temperate climate with mild winters and cool summers."
  },
  {
    "english": "landmark",
    "chinese": "地标",
    "example": "The Eiffel Tower is a famous landmark and popular tourist attraction in Paris."
  },
  {
    "english": "magnetic",
    "chinese": "磁性的",
    "example": "A compass uses a magnetic needle to point towards the Earth's magnetic north."
  },
  {
    "english": "constant",
    "chinese": "恒定的",
    "example": "The Earth's rotation around the Sun is a constant and predictable movement."
  },
  {
    "english": "tunnel",
    "chinese": "隧道",
    "example": "The highway tunnel allows vehicles to pass through the mountain range safely."
  },
  {
    "english": "navigation",
    "chinese": "导航",
    "example": "Modern navigation systems use GPS to help drivers find the best routes."
  },
  {
    "english": "extensive",
    "chinese": "广泛的",
    "example": "Extensive research has shown the benefits of regular exercise for overall health."
  },
  {
    "english": "revive",
    "chinese": "复活",
    "example": "Scientists are working to revive extinct species through cloning technology."
  },
  {
    "english": "tolerant",
    "chinese": "忍受的",
    "example": "Some plant species are tolerant of drought and can survive in arid environments."
  },
  {
    "english": "notion",
    "chinese": "概念",
    "example": "The notion of time travel has been explored in many science fiction stories."
  },
  {
    "english": "disperse",
    "chinese": "分散",
    "example": "Winds can disperse seeds over long distances, helping plants to spread."
  }
]