[
  {
    "english": "belief",
    "chinese": "信仰",
    "example": "Many people find comfort in their religious beliefs during difficult times."
  },
  {
    "english": "toss",
    "chinese": "抛，投",
    "example": "He decided to toss a coin to resolve the disagreement fairly."
  },
  {
    "english": "flaw",
    "chinese": "瑕疵",
    "example": "The diamond had a small flaw that reduced its value slightly."
  },
  {
    "english": "impact",
    "chinese": "影响",
    "example": "The new policy will have a significant impact on the environment."
  },
  {
    "english": "independent",
    "chinese": "独立的",
    "example": "She became financially independent after graduating from college and getting a job."
  },
  {
    "english": "solution",
    "chinese": "解决方案",
    "example": "Scientists are working on a solution to reduce plastic waste in the oceans."
  },
  {
    "english": "status",
    "chinese": "地位; 身份",
    "example": "The diplomat held a high status within the international community."
  },
  {
    "english": "candle",
    "chinese": "蜡烛",
    "example": "They lit candles to create a warm and cozy atmosphere in the room."
  },
  {
    "english": "literate",
    "chinese": "有读写能力的",
    "example": "In many countries, efforts are made to ensure all citizens become literate."
  },
  {
    "english": "optical",
    "chinese": "视力的",
    "example": "The optical illusion made the object appear larger than it actually was."
  },
  {
    "english": "affluence",
    "chinese": "富裕",
    "example": "The city's downtown area is known for its affluence and luxury shops."
  },
  {
    "english": "acknowledge",
    "chinese": "承认",
    "example": "He finally acknowledged that he had made a mistake in his calculations."
  },
  {
    "english": "budget",
    "chinese": "预算",
    "example": "We need to create a detailed budget for the upcoming construction project."
  },
  {
    "english": "corporation",
    "chinese": "公司",
    "example": "The multinational corporation operates in over 50 countries worldwide."
  },
  {
    "english": "federal",
    "chinese": "联邦的",
    "example": "The federal government is responsible for national defense and foreign policy."
  },
  {
    "english": "incentive",
    "chinese": "激励",
    "example": "The company offers financial incentives to employees who meet their sales targets."
  },
  {
    "english": "promote",
    "chinese": "促进",
    "example": "Regular exercise helps promote good health and reduces the risk of diseases."
  },
  {
    "english": "rural",
    "chinese": "农村的",
    "example": "Life in rural areas can be very different from that in big cities."
  },
  {
    "english": "substantial",
    "chinese": "大量的",
    "example": "The research project received substantial funding from the government."
  },
  {
    "english": "endowment",
    "chinese": "捐赠",
    "example": "The university used the endowment to establish a new scholarship program."
  },
  {
    "english": "patron",
    "chinese": "顾客",
    "example": "The café offers special discounts to its regular patrons."
  }
]