[
  {
    "english": "Mercury",
    "chinese": "水星；水银",
    "example": "Mercury is the closest planet to the Sun and has extreme temperature variations."
  },
  {
    "english": "Venus",
    "chinese": "金星",
    "example": "Venus is often called Earth's sister planet due to its similar size."
  },
  {
    "english": "organ",
    "chinese": "风琴",
    "example": "The cathedral's grand organ filled the space with majestic music."
  },
  {
    "english": "spice",
    "chinese": "香料",
    "example": "Traders imported exotic spices from Asia along ancient trade routes."
  },
  {
    "english": "literally",
    "chinese": "实际上的",
    "example": "The term 'planet' literally means 'wanderer' in ancient Greek."
  },
  {
    "english": "rarity",
    "chinese": "稀有性",
    "example": "The discovery of water on Mercury adds to its scientific rarity."
  },
  {
    "english": "exotic",
    "chinese": "奇异的",
    "example": "Venus has an exotic atmosphere composed mainly of carbon dioxide."
  },
  {
    "english": "imaging",
    "chinese": "成像",
    "example": "Advanced imaging techniques help scientists study distant planets."
  },
  {
    "english": "expressionism",
    "chinese": "表现主义",
    "example": "The artist's work combines elements of expressionism to convey emotion."
  },
  {
    "english": "bold",
    "chinese": "大胆的",
    "example": "The sculptor made bold choices in shaping the marble figure."
  },
  {
    "english": "stretch",
    "chinese": "拉伸",
    "example": "The dancer's ability to stretch her body impressed the audience."
  },
  {
    "english": "figure",
    "chinese": "身材",
    "example": "The ancient statue depicts a figure with idealized proportions."
  },
  {
    "english": "revolve",
    "chinese": "旋转",
    "example": "Planets revolve around stars due to gravitational forces."
  },
  {
    "english": "make sense",
    "chinese": "说得通，有意义",
    "example": "The theory of planetary formation makes sense of Mercury's unique features."
  },
  {
    "english": "work(s)",
    "chinese": "作品",
    "example": "The artist's works often explore themes of space and celestial bodies."
  },
  {
    "english": "prevail",
    "chinese": "变得流行",
    "example": "Expressionism began to prevail in art during the early 20th century."
  },
  {
    "english": "effective",
    "chinese": "有效的",
    "example": "Scientists use effective imaging methods to study planetary surfaces."
  },
  {
    "english": "import",
    "chinese": "进口",
    "example": "Ancient civilizations imported spices from distant lands for trade."
  },
  {
    "english": "inspire",
    "chinese": "激励; 鼓舞;",
    "example": "The beauty of Venus has inspired countless poems and paintings."
  },
  {
    "english": "mythical",
    "chinese": "神话的",
    "example": "Mercury was named after the mythical Roman messenger god."
  },
  {
    "english": "module",
    "chinese": "模块",
    "example": "Spacecraft often consist of multiple modules for different functions."
  },
  {
    "english": "satellite",
    "chinese": "卫星",
    "example": "Earth has one natural satellite, the Moon."
  },
  {
    "english": "philosopher",
    "chinese": "哲学家",
    "example": "Ancient philosophers debated the nature of the planets."
  },
  {
    "english": "estimate",
    "chinese": "估计",
    "example": "Scientists estimate Mercury's core makes up about 85% of its radius."
  },
  {
    "english": "orient",
    "chinese": "朝向",
    "example": "Early navigators used the stars to orient themselves at sea."
  },
  {
    "english": "navigator",
    "chinese": "航行者",
    "example": "Ancient Polynesians were skilled navigators who traveled vast oceans."
  },
  {
    "english": "overhead",
    "chinese": "头上方的",
    "example": "The overhead view of Mercury's surface reveals numerous impact craters."
  },
  {
    "english": "latitude",
    "chinese": "纬度",
    "example": "The equator is at 0 degrees latitude on Earth."
  },
  {
    "english": "host",
    "chinese": "寄主，宿主",
    "example": "A planet can host various forms of life if conditions are suitable."
  },
  {
    "english": "relatively",
    "chinese": "相对地",
    "example": "Mercury is relatively small compared to other planets in our solar system."
  },
  {
    "english": "orbit",
    "chinese": "围绕…运动",
    "example": "The Moon orbits Earth approximately once every 27.3 days."
  },
  {
    "english": "solar",
    "chinese": "太阳系",
    "example": "The solar system consists of the Sun and all the objects that orbit it."
  },
  {
    "english": "dwarf star",
    "chinese": "矮星",
    "example": "Our Sun is classified as a yellow dwarf star."
  },
  {
    "english": "authority",
    "chinese": "权威",
    "example": "Experts in astronomy are considered authorities on planetary science."
  },
  {
    "english": "carve",
    "chinese": "雕刻",
    "example": "Artisans carved intricate designs into the marble statue."
  },
  {
    "english": "expert",
    "chinese": "专家",
    "example": "Planetary geologists are experts in studying the surfaces of planets."
  },
  {
    "english": "extensive",
    "chinese": "广泛的",
    "example": "Scientists have conducted extensive research on Venus' atmosphere."
  },
  {
    "english": "armor",
    "chinese": "盔甲",
    "example": "The ancient warrior's armor was made of metal and leather."
  },
  {
    "english": "emperor",
    "chinese": "帝王",
    "example": "The emperor commissioned many grand statues and works of art."
  },
  {
    "english": "marble",
    "chinese": "大理石",
    "example": "Michelangelo's David is a famous sculpture carved from marble."
  },
  {
    "english": "statue",
    "chinese": "雕像",
    "example": "The statue of Venus de Milo is a renowned ancient Greek artwork."
  },
  {
    "english": "cloak",
    "chinese": "斗篷",
    "example": "The figure in the statue wears a flowing cloak that adds to its drama."
  },
  {
    "english": "glimpse",
    "chinese": "一瞥",
    "example": "We got a glimpse of Mercury's surface during the spacecraft flyby."
  },
  {
    "english": "virtue",
    "chinese": "美德",
    "example": "The philosopher emphasized the importance of virtues like wisdom and courage."
  }
]